# GetEdgeNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstrainedHandle..::..GetEdgeNumber Method
RebarConstrainedHandle Class See Also
---
If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int GetEdgeNumber()
```

Visual Basic
---
```text
Public Function GetEdgeNumber As Integer
```

Visual C++
---
```text
public:
int GetEdgeNumber()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle is not of RebarHandleType 'Edge'. |

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace